// 获取dom元素
var footers = document.querySelector(".footers")
var fourwords = document.querySelector("#fourwords")
var h1 = document.querySelector("h1")

// 随机生成成语
var words = ["甘之如饴","雾起云涌","气势磅礴","避嫌守义","革故鼎新","凯旋而归","碧瓦朱甍","水送山迎","我武维扬","变起萧墙","异卉奇花","乌鸟私情","舐犊之爱","餐风饮露","五彩缤纷","天长日久","起早贪黑","重见天日","心狠手辣","大摇大摆","争奇斗艳","九牛一毛","惟妙惟肖","意气风发","博大精深","一帆风顺","万事如意","妙手回春","风起云涌","纤尘不染","守正不阿","风骨峻峭","谢谢参与","从善如流","憨态可掬","迥乎不同","出人头地","亭亭玉立","推陈出新","文质彬彬","老树盘根","大智大勇","不甘示弱","英雄气概","悬梁刺股","废寝忘食","堂堂正正","独树一帜","志同道合","威风凛凛","忠贞不渝","乘风破浪","管鲍之交","自由自在","一五一十","如火如荼","气质非凡","解衣推食","手舞足蹈","心想事成","意气风发","机智勇敢","废寝忘食","志同道合","披星戴月","谦逊礼让","吹毛求疵","发奋图强","奋发图强","不知廉耻","云行雨施","布帆无恙","独树一帜","成仁取义","蹈厉之志","迎刃而解","既往不咎","宽宏大量","比肩齐声","老马识途","肃然起敬","无懈可击","扬眉吐气","持之以恒","游刃有余","五光十色","满面春光","孜孜不倦","诲人不倦","记忆犹新","接踵而至","表里不一","助人为乐","山盟海誓","千军万马","因时而异","豁达大度","饮水思源","人无远虑","连绵起伏","一碧如洗","绿叶成阴","立雪求道","漫天遍野","浇树浇根","烘云托月","根深固本","惊涛拍岸","众星捧月","引吭高歌","流星赶月","神通广大","防患未然","高耸入云","莘莘学子","连绵起伏"]
var num = Math.floor(Math.random()*words.length)
var checkword = words[num]

//删除左右两端的空格
function trim(str){ 
  return str.replace(/(^\s*)|(\s*$)/g, "");
}

window.onload = function() {
 num = Math.floor(Math.random()*words.length)
 checkword = words[num]
 h1.innerHTML = checkword 
 
}

// 点击提交
footers.addEventListener("click",function() {
  if(h1.innerHTML !== trim(fourwords.value)) {
    window.onload();
    return
  }
  window.location.href = "success.html";
})